Applying **prod**:
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.this_bucket has been changed
  ~ resource "aws_s3_bucket" "this_bucket" {
        id                          = "gitactionseduadevintaprod1455"
+       tags                        = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_s3_object.object has been changed
  ~ resource "aws_s3_object" "object" {
        id                 = "demo/directory/folder1/folder2/FolderC/FolderD"
+       metadata           = {}
+       tags               = {}
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.object must be replaced
-/+ resource "aws_s3_object" "object" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d41d8cd98f00b204e9800998ecf8427e" -> (known after apply)
      ~ id                     = "demo/directory/folder1/folder2/FolderC/FolderD" -> (known after apply)
      ~ key                    = "demo/directory/folder1/folder2/FolderC/FolderD" -> "demo/directory/folder1/folder2/FolderC/FolderD/FolderK/FolderLast" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
+       server_side_encryption = (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
+       version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
```
aws_s3_object.object: Destroying... [id=demo/directory/folder1/folder2/FolderC/FolderD]
aws_s3_object.object: Destruction complete after 1s
aws_s3_object.object: Creating...
aws_s3_object.object: Creation complete after 0s [id=demo/directory/folder1/folder2/FolderC/FolderD/FolderK/FolderLast]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```